s60sc/ESP32-CAM_MJPEG2SD/peripherals.cpp
/********************************* joystick  *************************************/

// HW-504 Joystick
// Use X axis  for steering, Y axis for motor, push button for lights toggle
// Requires 2 analog pins and 1 digital pin. Ideally supply voltage should be 3.1V
// X axis is longer edge of board

static const int sRate = 1; // samples per analog reading
static int xOffset = 0; // x zero offset
static int yOffset = 0; // y zero offset
static bool lightsChanged = false;
TaskHandle_t stickHandle = NULL;

static void IRAM_ATTR buttonISR() {
  // joystick button pressed - toggle state
  lightsChanged = !lightsChanged;
}

static void IRAM_ATTR stickISR() {
  // interrupt at timer rate
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  vTaskNotifyGiveFromISR(stickHandle, &xHigherPriorityTaskWoken); 
  if (xHigherPriorityTaskWoken == pdTRUE) portYIELD_FROM_ISR();
}

void stickTimer(bool restartTimer) {
  // timer 2 so dont conflict with mjpeg2sd or cam
  // determines joystick polling rate
  static hw_timer_t* stickTimer = NULL;
  // stop timer if running
  if (stickTimer) {
    timerAlarmDisable(stickTimer);   
    timerDetachInterrupt(stickTimer); 
    timerEnd(stickTimer);
  }
  if (restartTimer) {
    // (re)start timer 2 interrupt per required interval
    stickTimer = timerBegin(2, 8000, true); // 0.1ms tick
    int stickInterval = waitTime * 10; // in units of 0.1ms 
    timerAlarmWrite(stickTimer, stickInterval, true); 
    timerAlarmEnable(stickTimer);
    timerAttachInterrupt(stickTimer, &stickISR, true);
  }
}

static void stickTask (void *pvParameter) {
  static bool lightsStatus = false;
  while (true) {
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    // get joystick position, adjusted for zero offset
    int xPos = smoothAnalog(stickXpin, sRate);
    int steerAngle = (xPos > CENTER_ADC + xOffset) ? map(xPos, CENTER_ADC + xOffset, MAX_ADC, servoCenter, servoCenter + maxSteerAngle)
      : map(xPos, 0, CENTER_ADC + xOffset, servoCenter - maxSteerAngle, servoCenter); 
    setSteering(steerAngle);
    
    int yPos = smoothAnalog(stickYpin, sRate);
    // reverse orientation of Y axis so up is forward
    int motorCycle = (yPos > CENTER_ADC + yOffset) ? map(yPos, CENTER_ADC + yOffset, MAX_ADC, 0, 0 - maxDutyCycle)
      : map(yPos, 0, CENTER_ADC + yOffset, maxDutyCycle, 0); 
    if (abs(motorCycle) < minDutyCycle) motorCycle = 0; // deadzone
    motorSpeed(motorCycle);
    
    if (lightsChanged != lightsStatus) setLights(lightsChanged);
    lightsStatus = lightsChanged;
    LOG_DBG("Xpos %d, Ypos %d, button %d", xPos, yPos, lightsStatus);
  }
} 

static void prepJoystick() {
  if (stickUse) {
    if (stickXpin > 0 && stickYpin > 0) {
      // obtain offsets at joystick resting position
      xOffset = smoothAnalog(stickXpin, 8) - CENTER_ADC;
      yOffset = smoothAnalog(stickYpin, 8) - CENTER_ADC;
      LOG_DBG("X-offset: %d, Y-offset: %d", xOffset, yOffset);
      if (stickPushPin > 0) {
        pinMode(stickPushPin, INPUT_PULLUP);
        attachInterrupt(digitalPinToInterrupt(stickPushPin), buttonISR, FALLING); 
      }
      int stackSize = 2048;
#ifdef CONFIG_IDF_TARGET_ESP32S3 
      stackSize = 4096;
#endif
      xTaskCreate(&stickTask, "stickTask", stackSize, NULL, 5, &stickHandle);
      stickTimer(true);
      LOG_INF("Joystick available");
    } else LOG_WRN("Joystick pins not defined");
  }
}

/**********************************************/


void prepPeripherals() {
  // initial setup of each peripheral on client or extender
  setupADC();
  setupBatt();
  prepUart();
  setupLamp();
  prepPIR();
  prepTemperature();
  prepServos();  
  prepMotors();
  prepJoystick();
  debugMemory("prepPeripherals");
}
